#include <stdio.h>
#include "screen.h"


void PrintTitle()
{
	printf("####################################################### \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##                  도박 시뮬레이션                  ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##       1. 게임시작                                 ## \n");
	printf("##       2. 도움말                                   ## \n");
	printf("##       3. 게임종료                                 ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("####################################################### \n");
}

void PrintMainGame()
{
	printf("####################################################### \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##      1. 일하기                                    ## \n");
	printf("##      2. 도박하기                                  ## \n");
	printf("##      3. 은행으로 가기                             ## \n");
	printf("##      4. 빚 갚기                                   ## \n");
	printf("##      5. 타이틀로 돌아가기                         ## \n");
	printf("##                                                   ## \n");
	printf("####################################################### \n");
}

void PrintHelpTitle()
{
	printf("####################################################### \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##                  도박 시뮬레이션                  ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##       당신은 5000만원의 빚을 지고 있습니다.       ## \n");
	printf("##   빚을 모두 갚으면 게임은 간단하게 클리어됩니다.  ## \n");
	printf("##                                                   ## \n");
	printf("##       빚을 갚은 방법은 여러가지가 있습니다.       ## \n");
	printf("##    일을 해도 좋고 도박을 하는 것도 자유입니다.    ## \n");
	printf("##                                                   ## \n");
	printf("##        은행을 이용해서 대출을 해도 됩니다.        ## \n");
	printf("##                                                   ## \n");
	printf("##       q을 입력 시 다시 타이틀로 돌아갑니다.       ## \n");
	printf("##                                                   ## \n");
	printf("####################################################### \n");
}

void PrintEndGame()
{
	printf("####################################################### \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##                  도박 시뮬레이션                  ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("####################################################### \n");
}

void PrintWorkGame()
{
	printf("####################################################### \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##                      일하기                       ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##              키보드 A를 입력하세요.               ## \n");
	printf("##            50회 클릭 시 돈을 얻습니다.            ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##              q를 입력 시 뒤로 가기                ## \n");
	printf("##                                                   ## \n");
	printf("####################################################### \n");
}

void PrintGameblingGame()
{
	printf("####################################################### \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##                     도박하기                      ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##       어느 정도의 돈을 걸 것인지 입력하세요.      ## \n");
	printf("##         절반의 확률로 돈을 2배로 얻습니다.        ## \n");
	printf("##              실패 시 돈을 잃습니다.               ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##      1.만원   2.십만원   3.백만원   4.천만원      ## \n");
	printf("##                                                   ## \n");
	printf("##               q를 입력 시 뒤로 가기               ## \n");
	printf("##                                                   ## \n");
	printf("####################################################### \n");
}

void PrintGameblingSuccess()
{
	printf("####################################################### \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##                    도박 성공!                     ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##      당신은 도박에 성공해서 돈을 벌었습니다.      ## \n");
	printf("##            방금 얻은 돈까지 같이 걸면             ## \n");
	printf("##        더 많은 돈을 얻을 수 있지 않을까요?        ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##               q를 입력 시 뒤로 가기               ## \n");
	printf("##                                                   ## \n");
	printf("####################################################### \n");
}

void PrintGameblingFail()
{
	printf("####################################################### \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##                   도박 실패.....                  ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##      당신은 도박에 실패해서 돈을 잃었습니다.      ## \n");
	printf("##            하지만 실패는 성공의 어머니            ## \n");
	printf("##          다음 번에는 성공할거 같은데....?         ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##               q를 입력 시 뒤로 가기               ## \n");
	printf("##                                                   ## \n");
	printf("####################################################### \n");
}

void PrintBank()
{
	printf("####################################################### \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##                  은행에 왔습니다.                 ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##              무슨 목적으로 온건가요?              ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##       1.예금들기                                  ## \n");
	printf("##       2.대출하기                                  ## \n");
	printf("##       3.출금하기                                  ## \n");
	printf("##                                                   ## \n");
	printf("##               q를 입력 시 뒤로 가기               ## \n");
	printf("##                                                   ## \n");
	printf("####################################################### \n");
}

void PrintDeposit()
{
	printf("####################################################### \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##            당신은 예금을 하려고 합니다.           ## \n");
	printf("##                                                   ## \n");
	printf("##                 단위를 골라주세요.                ## \n");
	printf("##                                                   ## \n");
	printf("##       예금 단위에 비례하여 일하기의 효율 Up       ## \n");
	printf("##      [일하기 실행 시 예금의 0.2할 추가 획득]      ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##      1.만원   2.십만원   3.백만원   4.천만원      ## \n");
	printf("##                                                   ## \n");
	printf("##               q를 입력 시 뒤로 가기               ## \n");
	printf("##                                                   ## \n");
	printf("####################################################### \n");
}

void PrintLoan()
{
	printf("####################################################### \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##            당신은 대출을 하려고 합니다.           ## \n");
	printf("##                                                   ## \n");
	printf("##                 단위를 골라주세요.                ## \n");
	printf("##                                                   ## \n");
	printf("##            대출을 하면 빚이 늘어납니다.           ## \n");
	printf("##                이자는 대출값의 2할                ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##      1.만원   2.십만원   3.백만원   4.천만원      ## \n");
	printf("##                                                   ## \n");
	printf("##               q를 입력 시 뒤로 가기               ## \n");
	printf("##                                                   ## \n");
	printf("####################################################### \n");
}

void Printwithdraw()
{
	printf("####################################################### \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##               출금을 하시려는건가요?              ## \n");
	printf("##                                                   ## \n");
	printf("##                 단위를 골라주세요.                ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##        예금이 줄어들면 일하기의 효율 Down         ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##      1.만원   2.십만원   3.백만원   4.천만원      ## \n");
	printf("##                                                   ## \n");
	printf("##               q를 입력 시 뒤로 가기               ## \n");
	printf("##                                                   ## \n");
	printf("####################################################### \n");
}

void PrintFreeDebt()
{
	printf("####################################################### \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##           생각보다 빨리 갚으러 오셨네요           ## \n");
	printf("##                                                   ## \n");
	printf("##                 단위를 골라주세요.                ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##       빚을 전부 갚으면 게임이 클리어됩니다.       ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##      1.만원   2.십만원   3.백만원   4.천만원      ## \n");
	printf("##                                                   ## \n");
	printf("##               q를 입력 시 뒤로 가기               ## \n");
	printf("##                                                   ## \n");
	printf("####################################################### \n");
}

void PrintEnding()
{
	printf("####################################################### \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##                   축하드립니다.                   ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##           거액의 빚을 모두 갚은 그 정신           ## \n");
	printf("##          매우 훌륭하다고 할 수 있습니다.          ## \n");
	printf("##                                                   ## \n");
	printf("##         빚은 어떤 방식으로 갚게 되었나요?         ## \n");
	printf("##                                                   ## \n");
	printf("##        어느 쪽이든 게임 클리어를 다시 한번        ## \n");
	printf("##                                                   ## \n");
	printf("##                                                   ## \n");
	printf("##                    축하드립니다.                  ## \n");
	printf("##                                                   ## \n");
	printf("####################################################### \n");
}